HasLargeSketches Method
 Checks whether the family contains sketches with a large number of elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017
 Syntax
  C#
public bool HasLargeSketches()
  Visual Basic
Public Function HasLargeSketches As Boolean
  Visual C++
public:
bool HasLargeSketches()
 Remarks
 Families containing large sketches (typically with 300+ elements) may cause performance problems in parametric families (see  IsParametric  ). Thus, before adding any constraints to a family (which will make the family parametric,) this method can be queried and the decision about whether the family should indeed be turned parametric may be deferred to the end-user.
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →